/**
 * тестовий приклад створення 2 користувачів та монтування таблиці
 */

 let users = new UserCollectionWithDOM();

 users.add(
    new User(
        "Тегза А. М.",
        "Жіночий",
        "1987",
        "Ужну:Математика та цифрові технології",
        "Математика",
        "10.09.2000.",
        "https://cdn.pixabay.com/photo/2016/04/26/07/57/woman-1353825_960_720.png"
    )
);
 
 users.add(
     new User(
         "Андрашко В. Ю.",
         "Чоловічий",
         "1987",
         "Ужну:Математика та цифрові технології",
         "Прикладна математика",
         "10.10.2004.",
         "https://cdn.pixabay.com/photo/2014/04/03/10/32/businessman-310819_960_720.png"
     )
 );
 
 users.add(
     new User(
        "Брила В. Ю.",
        "Чоловічий",
        "1987",
        "Ужну:Математика та цифрові технології",
        "Прикладна математика",
        "12.10.2000.",
         "https://cdn.pixabay.com/photo/2014/04/03/10/32/businessman-310819_960_720.png"
     )
 );

 users.add(
    new User(
       "Мулеса П. П.",
       "Чоловічий",
       "1990",
       "Ужну:Математика та цифрові технології",
       "Прикладна математика",
       "19.10.2008.",
        "https://cdn.pixabay.com/photo/2014/04/03/10/32/businessman-310819_960_720.png"
    )
);

users.add(
    new User(
       "Млавець Ю. Ю.",
       "Чоловічий",
       "1990",
       "Ужну:Математика та цифрові технології",
       "Прикладна математика",
       "19.10.2008.",
        "https://cdn.pixabay.com/photo/2014/04/03/10/32/businessman-310819_960_720.png"
    )
);
 
 users.mount(document.getElementById("root"));